<a href="https://colab.research.google.com/github/MadeaRiggs/AIPlanet-Data-Science/blob/main/AIPlanet_DS_Quiz_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
titanic_data = pd.read_csv("https://raw.githubusercontent.com/dphi-official/First_ML_Model/master/titanic.csv", index_col = 'PassengerId')
titanic_data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [ ]:
titanic_data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
titanic_data[titanic_data["Sex"] == "male"].count()

Survived    577
Pclass      577
Name        577
Sex         577
Age         453
SibSp       577
Parch       577
Ticket      577
Fare        577
Cabin       107
Embarked    577
dtype: int64

In [ ]:
titanic_data[titanic_data["Sex"] == "female"].count()

Survived    314
Pclass      314
Name        314
Sex         314
Age         261
SibSp       314
Parch       314
Ticket      314
Fare        314
Cabin        97
Embarked    312
dtype: int64

In [ ]:
titanic_data["SibSp"].mode()

0    0
dtype: int64

In [ ]:
titanic_data[(titanic_data["Survived"] == 1)].count() / titanic_data["Survived"].count()

Survived    0.383838
Pclass      0.383838
Name        0.383838
Sex         0.383838
Age         0.325477
SibSp       0.383838
Parch       0.383838
Ticket      0.383838
Fare        0.383838
Cabin       0.152637
Embarked    0.381594
dtype: float64

In [ ]:
titanic_data[(titanic_data['Survived'] == 1) & (titanic_data['Sex'] == 'male')].count()

Survived    109
Pclass      109
Name        109
Sex         109
Age          93
SibSp       109
Parch       109
Ticket      109
Fare        109
Cabin        45
Embarked    109
dtype: int64

In [ ]:
titanic_data[(titanic_data['Survived'] == 1) & (titanic_data['Sex'] == 'female')].count()

Survived    233
Pclass      233
Name        233
Sex         233
Age         197
SibSp       233
Parch       233
Ticket      233
Fare        233
Cabin        91
Embarked    231
dtype: int64

In [ ]:
titanic_data[(titanic_data['Survived'] == 1) & (titanic_data['Pclass'] == 1)].count()

Survived    136
Pclass      136
Name        136
Sex         136
Age         122
SibSp       136
Parch       136
Ticket      136
Fare        136
Cabin       117
Embarked    134
dtype: int64

In [ ]:
titanic_data[(titanic_data['Survived'] == 1) & (titanic_data['Pclass'] == 2)].count()

Survived    87
Pclass      87
Name        87
Sex         87
Age         83
SibSp       87
Parch       87
Ticket      87
Fare        87
Cabin       13
Embarked    87
dtype: int64

In [ ]:
titanic_data[(titanic_data['Survived'] == 1) & (titanic_data['Pclass'] == 3)].count()

Survived    119
Pclass      119
Name        119
Sex         119
Age          85
SibSp       119
Parch       119
Ticket      119
Fare        119
Cabin         6
Embarked    119
dtype: int64

In [ ]:
titanic_data[(titanic_data['Survived'] == 1) & (titanic_data['Age'] < 18)].count()

Survived    61
Pclass      61
Name        61
Sex         61
Age         61
SibSp       61
Parch       61
Ticket      61
Fare        61
Cabin       17
Embarked    61
dtype: int64

In [ ]:
titanic_data[(titanic_data['Survived'] == 1) & (titanic_data['Age'] >= 18)].count()

Survived    229
Pclass      229
Name        229
Sex         229
Age         229
SibSp       229
Parch       229
Ticket      229
Fare        229
Cabin       108
Embarked    227
dtype: int64

In [ ]:
survived_passengers= titanic_data[(titanic_data['Survived'] == 1)]
survived_passengers

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [ ]:
survived_passengers[(survived_passengers['Embarked'] == 'S')].count()

Survived    217
Pclass      217
Name        217
Sex         217
Age         201
SibSp       217
Parch       217
Ticket      217
Fare        217
Cabin        80
Embarked    217
dtype: int64

In [ ]:
#Five highest fares of the passengers:
titanic_data['Fare'].nlargest()

PassengerId
259    512.3292
680    512.3292
738    512.3292
28     263.0000
89     263.0000
Name: Fare, dtype: float64

In [ ]:
titanic_data['Name'].nunique()

891